uhnp/src/Reports/АнализПроцессов/АнализПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АнализПроцессов</name>
  <attributes>
    <name>ШаблонПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАнализа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАнализа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Метрика</name>
    <type>
      <types>EnumRef.МетрикиАнализаПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаДанныеРасшифровки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаСхемаКомпоновки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностиАнализаПроцессов</types>
    </type>
  </attributes>
</mdclass:Report>

uhnp/src/Enums/ПериодичностиАнализаПроцессов/ПериодичностиАнализаПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПериодичностиАнализаПроцессов</name>
  <enumValues>
    <name>Секунды</name>
  </enumValues>
  <enumValues>
    <name>Часы</name>
  </enumValues>
  <enumValues>
    <name>Дни</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Reports/АнализПроцессов/Forms/ФормаРасшифровкиРаспределения/Module.bsl
// Формирует пустую таблицу анализа.
&НаСервереБезКонтекста
Функция ИнициализироватьТаблицуАнализа()
	РезультатФункции = Новый ТаблицаЗначений;
	РезультатФункции.Колонки.Добавить("ДлительностьМаксимум");
	РезультатФункции.Колонки.Добавить("ДлительностьСредняя");
	РезультатФункции.Колонки.Добавить("Организация");
	РезультатФункции.Колонки.Добавить("ШаблонПроцесса");
	РезультатФункции.Колонки.Добавить("ДлительностьПлановая");
	РезультатФункции.Колонки.Добавить("ЭтапПроцесса");
	РезультатФункции.Колонки.Добавить("ДлительностьМинимум");
	РезультатФункции.Колонки.Добавить("ДлительностьСумма");
	РезультатФункции.Колонки.Добавить("ДлительностьКоличество");
	РезультатФункции.Колонки.Добавить("ТипОбъектаСогласования");
	РезультатФункции.Колонки.Добавить("ДокументПроцесса");
	РезультатФункции.Колонки.Добавить("Автор");
	РезультатФункции.Колонки.Добавить("КоличествоОтклонений");
	Возврат РезультатФункции;
КонецФункции		// ИнициализироватьТаблицуАнализа()

// Преобразует поля времени согласно периодичности ПериодичностьВход.
&НаСервереБезКонтекста
Функция ПреобразоватьПериодичностьВТаблицеАнализа(ТаблицаАнализВход, ПериодичностьВход)
	РезультатФункции = ТаблицаАнализВход.Скопировать();
	Для Каждого ТекРезультатФункции Из РезультатФункции Цикл
		ТекРезультатФункции.ДлительностьМаксимум	 = УправлениеПроцессамиСогласованияУХ.ПреобразоватьВремяПоПериодичности(ТекРезультатФункции.ДлительностьМаксимум, ПериодичностьВход);
		ТекРезультатФункции.ДлительностьМинимум		 = УправлениеПроцессамиСогласованияУХ.ПреобразоватьВремяПоПериодичности(ТекРезультатФункции.ДлительностьМинимум, ПериодичностьВход);
		ТекРезультатФункции.ДлительностьПлановая	 = УправлениеПроцессамиСогласованияУХ.ПреобразоватьВремяПоПериодичности(ТекРезультатФункции.ДлительностьПлановая, ПериодичностьВход);
		ТекРезультатФункции.ДлительностьСредняя		 = УправлениеПроцессамиСогласованияУХ.ПреобразоватьВремяПоПериодичности(ТекРезультатФункции.ДлительностьСредняя, ПериодичностьВход);
		ТекРезультатФункции.ДлительностьСумма		 = УправлениеПроцессамиСогласованияУХ.ПреобразоватьВремяПоПериодичности(ТекРезультатФункции.ДлительностьСумма, ПериодичностьВход);
	КонецЦикла;	
	Возврат РезультатФункции;
КонецФункции		// ПреобразоватьПериодичностьВТаблицеАнализа()

// Преобразует исходную таблицу ИсходнаяТаблицаВход по метрике МетрикаВход в дерево 
// отображения на форме и выводит его. Временные единицы преобразует в единицы,
// соответствующим периодичности ПериодичностьВход.
&НаСервере
Процедура ПреобразоватьТаблицуИсходныхДанных(ИсходнаяТаблицаВход, МетрикаВход, ПериодичностьВход)
	//  Создание таблицы анализа из исходной таблицы.
	ТаблицаАнализ = ИнициализироватьТаблицуАнализа();
	Для Каждого ТекИсходнаяТаблицаВход Из ИсходнаяТаблицаВход Цикл
		НоваяСтрока = ТаблицаАнализ.Добавить();
		НоваяСтрока.ДлительностьМаксимум	 = ТекИсходнаяТаблицаВход.ДлительностьМаксимум;
		НоваяСтрока.ДлительностьСредняя		 = ТекИсходнаяТаблицаВход.ДлительностьСредняя;
		НоваяСтрока.Организация				 = ТекИсходнаяТаблицаВход.Организация;
		НоваяСтрока.ШаблонПроцесса			 = ТекИсходнаяТаблицаВход.ЭтапПроцесса.Владелец;
		НоваяСтрока.ДлительностьПлановая	 = ТекИсходнаяТаблицаВход.ДлительностьПлановая;
		НоваяСтрока.ЭтапПроцесса			 = ТекИсходнаяТаблицаВход.ЭтапПроцесса;
		НоваяСтрока.ДлительностьМинимум		 = ТекИсходнаяТаблицаВход.ДлительностьМинимум;
		НоваяСтрока.ДлительностьСумма		 = ТекИсходнаяТаблицаВход.ДлительностьСумма;
		НоваяСтрока.ДлительностьКоличество	 = ТекИсходнаяТаблицаВход.ДлительностьКоличество;
		НоваяСтрока.ТипОбъектаСогласования	 = ТекИсходнаяТаблицаВход.ДокументПроцесса.ТипКлючевогоОбъекта;
		НоваяСтрока.ДокументПроцесса		 = ТекИсходнаяТаблицаВход.ДокументПроцесса;
		НоваяСтрока.Автор					 = ТекИсходнаяТаблицаВход.Автор;
		НоваяСтрока.КоличествоОтклонений	 = ТекИсходнаяТаблицаВход.КоличествоОтклонений;
	КонецЦикла;
	// Обработка таблицы.
	ТаблицаАнализ = ПреобразоватьПериодичностьВТаблицеАнализа(ТаблицаАнализ, ПериодичностьВход);
	// Получение СКД.
	ДанныеРасшифровки = Неопределено;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");       
	МакетДокумента = ОбъектОбработки.ПолучитьМакет("МакетАнализПоОрганизациям");
	КомпоновщикАнализ = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикАнализ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(МакетДокумента));
	Вариант = МакетДокумента.ВариантыНастроек[1];  		// Вариант "По этапам"
	КомпоновщикАнализ.ЗагрузитьНастройки(Вариант.Настройки);
	// Установка параметров.
	КомпоновщикАнализ.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Метрика", Метрика);
	// Настройка таблицы и диаграммы.
	НастройкиКомпоновщика = КомпоновщикАнализ.ПолучитьНастройки();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетДокумента, НастройкиКомпоновщика, ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")) ;
	// Вывод в дерево.
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	СтруктураВнешниеНаборы = Новый Структура;
	СтруктураВнешниеНаборы.Вставить("ТЗ_Анализ", ТаблицаАнализ);
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, СтруктураВнешниеНаборы, ДанныеРасшифровки);
	ДеревоРезультат = Новый ДеревоЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДеревоРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	// Формирование временного дерева.
	ДеревоВрем = Новый ДеревоЗначений;
	ДеревоВрем.Колонки.Добавить("ИзмерениеТаблицы");
	ДеревоВрем.Колонки.Добавить("ЗначениеМетрики");
	ДеревоВрем.Колонки.Добавить("КлючевойОбъект");
	Для Каждого ТекСтрокиОрганизация Из ДеревоРезультат.Строки Цикл
		// Строка организации.
		НоваяСтрокаОрганизация = ДеревоВрем.Строки.Добавить();
		Если ЗначениеЗаполнено(ТекСтрокиОрганизация.Организация) Тогда
			НоваяСтрокаОрганизация.ИзмерениеТаблицы = ТекСтрокиОрганизация.Организация;
		Иначе
			НоваяСтрокаОрганизация.ИзмерениеТаблицы = НСтр("ru = '<Неизвестная организация>'");
		КонецЕсли;
		НоваяСтрокаОрганизация.ЗначениеМетрики = ОбъектОбработки.ЗначениеСтрокиПоМетрике(ТекСтрокиОрганизация, МетрикаВход);
		Для Каждого ТекСтрокаЭтапы Из ТекСтрокиОрганизация.Строки Цикл
			// Строка этапа.
			НоваяСтрокаЭтап = НоваяСтрокаОрганизация.Строки.Добавить();
			Если ЗначениеЗаполнено(ТекСтрокаЭтапы.ЭтапПроцесса) Тогда
				НоваяСтрокаЭтап.ИзмерениеТаблицы = ТекСтрокаЭтапы.ЭтапПроцесса;
			Иначе	
				НоваяСтрокаЭтап.ИзмерениеТаблицы = НСтр("ru = '<Неизвестный этап>'");
			КонецЕсли;
			НоваяСтрокаЭтап.ЗначениеМетрики = ОбъектОбработки.ЗначениеСтрокиПоМетрике(ТекСтрокаЭтапы, МетрикаВход);
			Для Каждого ТекСтрокаАвтор Из ТекСтрокаЭтапы.Строки Цикл
				// Строка автора.
				НоваяСтрокаАвтор = НоваяСтрокаЭтап.Строки.Добавить();
				Если ЗначениеЗаполнено(ТекСтрокаАвтор.Автор) Тогда
					НоваяСтрокаАвтор.ИзмерениеТаблицы = ТекСтрокаАвтор.Автор;
				Иначе	
					НоваяСтрокаАвтор.ИзмерениеТаблицы = НСтр("ru = '<Неизвестный пользователь>'");
				КонецЕсли;
				НоваяСтрокаАвтор.ЗначениеМетрики = ОбъектОбработки.ЗначениеСтрокиПоМетрике(ТекСтрокаАвтор, МетрикаВход);
				Для Каждого ТекСтрокаДетальныеЗаписи Из ТекСтрокаАвтор.Строки Цикл
					// Строка детальные записи.
					НоваяСтрокаДетальныеЗаписи = НоваяСтрокаАвтор.Строки.Добавить();
					Если ЗначениеЗаполнено(ТекСтрокаДетальныеЗаписи.ДокументПроцесса) Тогда
						НоваяСтрокаДетальныеЗаписи.ИзмерениеТаблицы = ТекСтрокаДетальныеЗаписи.ДокументПроцесса;
						НоваяСтрокаДетальныеЗаписи.КлючевойОбъект = ТекСтрокаДетальныеЗаписи.ДокументПроцесса.КлючевойОбъектПроцесса;
					Иначе
						НоваяСтрокаДетальныеЗаписи.ИзмерениеТаблицы = НСтр("ru = '<Неизвестный процесс>'");
					КонецЕсли;
					НоваяСтрокаДетальныеЗаписи.ЗначениеМетрики = ОбъектОбработки.ЗначениеСтрокиПоМетрике(ТекСтрокаДетальныеЗаписи, МетрикаВход);
				КонецЦикла;
				НоваяСтрокаАвтор.Строки.Сортировать("ЗначениеМетрики Убыв");
			КонецЦикла;
			НоваяСтрокаЭтап.Строки.Сортировать("ЗначениеМетрики Убыв");
		КонецЦикла;
		НоваяСтрокаОрганизация.Строки.Сортировать("ЗначениеМетрики Убыв");
	КонецЦикла;
	ДеревоВрем.Строки.Сортировать("ЗначениеМетрики Убыв");
	// Вывод итогового дерева.
	ЗначениеВРеквизитФормы(ДеревоВрем, "ДеревоОтображение");
КонецПроцедуры		// ПреобразоватьТаблицуИсходныхДанных()

// Выводит данные из исходной таблицы в таблицу отображения на форме.
&НаСервере
Процедура СчитатьТаблицуОтображение()
	ВыгрузкаИсходнаяТаблица = ТаблицаИсходныеДанные.Выгрузить();
	ПреобразоватьТаблицуИсходныхДанных(ВыгрузкаИсходнаяТаблица, Метрика, Объект.Периодичность);
КонецПроцедуры		// СчитатьТаблицуОтображение()

// Сворачивает дерево этапов на форме.
&НаКлиенте
Процедура СвернутьДерево()
	ЭлементыДереваОрганизаций = ДеревоОтображение.ПолучитьЭлементы();
	Для Каждого ТекЭлементыДереваОрганизаций Из ЭлементыДереваОрганизаций Цикл 
		ТекИдентификатор = ТекЭлементыДереваОрганизаций.ПолучитьИдентификатор();
		Элементы.ДеревоОтображение.Свернуть(ТекИдентификатор);
	КонецЦикла;
КонецПроцедуры		// СвернутьДерево()

// Разворачивает дерево на форме.
&НаКлиенте
Процедура РазвернутьДерево()
	ЭлементыДереваОрганизаций = ДеревоОтображение.ПолучитьЭлементы();
	Для Каждого ТекЭлементыДереваОрганизаций Из ЭлементыДереваОрганизаций Цикл 
		ТекИдентификатор = ТекЭлементыДереваОрганизаций.ПолучитьИдентификатор();
		Элементы.ДеревоОтображение.Развернуть(ТекИдентификатор, Истина);
	КонецЦикла;
КонецПроцедуры		// РазвернутьДерево()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Получение параметров.
	Метрика = Параметры.Метрика;
	Если ЭтоАдресВременногоХранилища(Параметры.АдресТаблицыРасшифровки) Тогда
		ВыгрузкаИсходныхДанных = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыРасшифровки);
		ТаблицаИсходныеДанные.Загрузить(ВыгрузкаИсходныхДанных);
		СчитатьТаблицуОтображение();
	Иначе
		ТаблицаИсходныеДанные.Очистить();
		ТаблицаОтображение.Очистить();
	КонецЕсли;
	// Заполнение по умолчанию.
	Если НЕ ЗначениеЗаполнено(Объект.Периодичность) Тогда
		Объект.Периодичность = Перечисления.ПериодичностиАнализаПроцессов.Часы;
	Иначе
		// Значение установлено.
	КонецЕсли;
	// Оформление формы.
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	Элементы.ДеревоОтображениеЗначениеМетрики.Заголовок = Строка(Метрика);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлючевойОбъект(Команда)
	ТекДанные = Элементы.ДеревоОтображение.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекДанные.КлючевойОбъект) Тогда
		ПоказатьЗначение(, ТекДанные.КлючевойОбъект);
		Иначе
			ТекстСообщения = НСтр("ru = 'Не удалось определить объект согласования'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		КонецЕсли;
	Иначе
		// Строка не выбрана. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение(Команда)
	СчитатьТаблицуОтображение();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	СвернутьДерево();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	РазвернутьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РазвернутьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	СчитатьТаблицуОтображение();
КонецПроцедуры
